In [ ]:
# 重命名文件：File -> Rename；
# 保存文件：1). File -> Save and Checkpoint, 会将文件保存到默认路径下，且格式默认为ipynb.
#           2). File -> Download as -> 选择想要保存的格式及保存路径
# 导入本地jupyter notebook文件
# 点击upload按钮

### 2.3.7 添加目录

In [ ]:
def learn_python(location):
    print("我正在{}上学Python".format(location))
    
learn_python("地铁")

# 第8章 数据运算

In [1]:
%config IPCompleter.greedy=True

In [2]:
import pandas as pd
df = pd.DataFrame([[1, 2, 3], [4, 5, 6]],
                  columns=["C1", "C2", "C3"],
                  index=["S1", "S2"])
df

    C1  C2  C3
S1   1   2   3
S2   4   5   6

## 8.1 算术运算

In [3]:
df["C1"] + df["C2"]

S1    3
S2    9
dtype: int64

In [4]:
df["C1"] - df["C2"]

S1   -1
S2   -1
dtype: int64

In [5]:
df["C1"] * df["C2"]

S1     2
S2    20
dtype: int64

In [6]:
df["C1"] / df["C2"]

S1    0.5
S2    0.8
dtype: float64

In [7]:
df["C1"] + 2

S1    3
S2    6
Name: C1, dtype: int64

In [8]:
df["C1"] - 2

S1   -1
S2    2
Name: C1, dtype: int64

In [9]:
df["C1"] * 2

S1    2
S2    8
Name: C1, dtype: int64

In [10]:
df["C1"] / 2

S1    0.5
S2    2.0
Name: C1, dtype: float64

## 8.2 比较运算

In [11]:
df["C1"] > df["C2"]

S1    False
S2    False
dtype: bool

In [12]:
df["C1"] != df["C2"]

S1    True
S2    True
dtype: bool

In [13]:
df["C2"] != df["C3"]

S1    True
S2    True
dtype: bool

## 8.3 汇总运算

### 8.3.1 count 非空值计数

In [14]:
df.count()

C1    2
C2    2
C3    2
dtype: int64

In [15]:
df.count(axis = 1)

S1    3
S2    3
dtype: int64

In [16]:
df["C1"].count()

2

### 8.3.2 sum 求和

In [17]:
df.sum()

C1    5
C2    7
C3    9
dtype: int64

In [18]:
df.sum(axis = 1)

S1     6
S2    15
dtype: int64

In [19]:
df["C1"].sum()

5

### 8.3.3 mean 求均值

In [20]:
df.mean()

C1    2.5
C2    3.5
C3    4.5
dtype: float64

In [21]:
df.mean(axis = 1)

S1    2.0
S2    5.0
dtype: float64

In [22]:
df["C1"].mean()

2.5

### 8.3.4 max 求最大值

In [23]:
df.max()

C1    4
C2    5
C3    6
dtype: int64

In [24]:
df.max(axis = 1)

S1    3
S2    6
dtype: int64

In [25]:
df["C1"].max()

4

### 8.3.5 min 求最小值

In [26]:
df.min()

C1    1
C2    2
C3    3
dtype: int64

In [27]:
df.min(axis = 1)

S1    1
S2    4
dtype: int64

In [28]:
df["C1"].min()

1

### 8.3.6 median求中位数

In [29]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]],
                  columns=["C1", "C2", "C3"],
                  index=["S1", "S2", "S3"])
df

    C1  C2  C3
S1   1   2   3
S2   4   5   6
S3   7   8   9

In [30]:
df.median()

C1    4.0
C2    5.0
C3    6.0
dtype: float64

In [31]:
df.median(axis = 1)

S1    2.0
S2    5.0
S3    8.0
dtype: float64

In [32]:
df["C1"].median()

4.0

### 8.3.7 mode求众数

In [33]:
df = pd.DataFrame([[1, 1, 3], [4, 4, 6], [1, 1, 3]],
                  columns=["C1", "C2", "C3"],
                  index=["S1", "S2", "S3"])
df

    C1  C2  C3
S1   1   1   3
S2   4   4   6
S3   1   1   3

In [34]:
df.mode()

   C1  C2  C3
0   1   1   3

In [35]:
df.mode(axis = 1)

    0
S1  1
S2  4
S3  1

In [36]:
df["C1"].mode()

0    1
dtype: int64

### 8.3.8 var 求方差

In [37]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]],
                  columns=["C1", "C2", "C3"],
                  index=["S1", "S2", "S3"])
df

    C1  C2  C3
S1   1   2   3
S2   4   5   6
S3   7   8   9

In [38]:
df.var()

C1    9.0
C2    9.0
C3    9.0
dtype: float64

In [39]:
df.var(axis = 1)

S1    1.0
S2    1.0
S3    1.0
dtype: float64

In [40]:
df["C1"].var()

9.0

### 8.3.9 std 求标准差

In [41]:
df.std()

C1    3.0
C2    3.0
C3    3.0
dtype: float64

In [42]:
df.std(axis = 1)

S1    1.0
S2    1.0
S3    1.0
dtype: float64

In [43]:
df["C1"].std()

3.0

### 8.3.10 quantile 求分位数

In [44]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12], [13, 14, 15]],
                  columns=["C1", "C2", "C3"],
                  index=["S1", "S2", "S3", "S4", "S5"])
df

    C1  C2  C3
S1   1   2   3
S2   4   5   6
S3   7   8   9
S4  10  11  12
S5  13  14  15

In [45]:
df.quantile(0.25)

C1    4.0
C2    5.0
C3    6.0
Name: 0.25, dtype: float64

In [46]:
df.quantile(0.75)

C1    10.0
C2    11.0
C3    12.0
Name: 0.75, dtype: float64

In [47]:
df.quantile(0.25, axis = 1)

S1     1.5
S2     4.5
S3     7.5
S4    10.5
S5    13.5
Name: 0.25, dtype: float64

In [48]:
df["C1"].quantile(0.25)

4.0

## 8.4 相关性运算

In [49]:
df = pd.DataFrame([[1, 2], [3, 4], [5, 6], [7, 8], [9, 10]],
                  columns = ["col1", "col2"],
                  index = [0, 1, 2, 3, 4])
df

   col1  col2
0     1     2
1     3     4
2     5     6
3     7     8
4     9    10

In [50]:
df["col1"].corr(df["col2"])  # 求取col1 列与 col2 列的相关系数

0.9999999999999999

In [51]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12], [13, 14, 15]],
                  columns = ["col1", "col2", "col3"],
                  index = [0, 1, 2, 3, 4])
df

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9
3    10    11    12
4    13    14    15

In [52]:
df.corr()  # 求取整个 DataFrame 表中各字段两两之间的相关性

      col1  col2  col3
col1   1.0   1.0   1.0
col2   1.0   1.0   1.0
col3   1.0   1.0   1.0

# 第9章 时间序列

## 9.1 获取当前时刻的时间

### 9.1.1 返回当前时刻的日期和时间

In [53]:
from datetime import datetime
datetime.now()

datetime.datetime(2020, 2, 11, 11, 37, 26, 60739)

### 9.1.2 分别返回当前时刻的年、月、日

In [54]:
datetime.now().year

2020

In [55]:
datetime.now().month

2

In [56]:
datetime.now().day

11

### 9.1.3 返回当前时刻的周数

In [57]:
datetime.now().weekday() + 1  # 返回当前时刻是周几

2

In [58]:
datetime.now().isocalendar()  # 2020年第6周的第4天

(2020, 7, 2)

In [59]:
datetime.now().isocalendar()[1]  # 返回周数

7

## 9.2 指定日期和时间的格式

In [60]:
datetime.now().date()  # 借助date()函数将日期和时间设置成只展示日期

datetime.date(2020, 2, 11)

In [61]:
datetime.now().time()  # 借助time()函数将日期和时间设置成只展示时间

datetime.time(11, 37, 26, 285138)

In [62]:
datetime.now().strftime('%Y-%m-%d')  # 自定义时间和日期的格式

'2020-02-11'

In [63]:
datetime.now().strftime("%Y-%m-%d %H:%M:%S")  # 自定义时间和日期的格式

'2020-02-11 11:37:26'

## 9.3 字符串和时间格式相互转换

### 9.3.1 将时间格式转换为字符串

In [64]:
now = datetime.now()
now

datetime.datetime(2020, 2, 11, 11, 37, 26, 477648)

In [65]:
type(str(now))

str

### 9.3.2 将字符串格式转换为时间格式

In [66]:
now_time = "2020-02-07"
type(now_time)  # 查看变量str_time的数据类型

str

In [67]:
from dateutil.parser import parse
parse(now_time)  # 将字符串解析为时间

datetime.datetime(2020, 2, 7, 0, 0)

In [68]:
type(parse(now_time))

datetime.datetime

## 9.4 时间索引

In [69]:
import pandas as pd
import numpy as np
index = pd.DatetimeIndex(['2020-02-01', '2020-02-02', '2020-02-03', '2020-02-04', '2020-02-05', '2020-02-06', '2020-02-07', '2020-02-08', '2020-02-09', '2020-02-10'])
data = pd.DataFrame(np.arange(1, 11), columns = ["num"], index = index)
data

            num
2020-02-01    1
2020-02-02    2
2020-02-03    3
2020-02-04    4
2020-02-05    5
2020-02-06    6
2020-02-07    7
2020-02-08    8
2020-02-09    9
2020-02-10   10

In [70]:
data["2020"]  # 获取2020年的数据

            num
2020-02-01    1
2020-02-02    2
2020-02-03    3
2020-02-04    4
2020-02-05    5
2020-02-06    6
2020-02-07    7
2020-02-08    8
2020-02-09    9
2020-02-10   10

In [71]:
data["2020-02"]  # 获取2020年2月的数据

            num
2020-02-01    1
2020-02-02    2
2020-02-03    3
2020-02-04    4
2020-02-05    5
2020-02-06    6
2020-02-07    7
2020-02-08    8
2020-02-09    9
2020-02-10   10

In [72]:
data["2020-02-01":"2020-02-05"]  # 获取获取2020年2月1日到2月5日的数据

            num
2020-02-01    1
2020-02-02    2
2020-02-03    3
2020-02-04    4
2020-02-05    5

In [73]:
data["2020-02-01":"2020-02-01"]  # 获取获取2020年2月1日的数据

            num
2020-02-01    1

以上索引方法适用于索引是时间的情况下，并非所有情况。可以用布尔索引来对非索引列的时间进行选取，如下：

In [74]:
df = pd.DataFrame([["张通", 101, 31, "2018-08-08"], 
                   ["李古", 102, 45, "2018-08-09"], 
                   ["孙凤", 103, 23, "2018-08-10"],
                   ["赵恒", 104, 36, "2018-08-11"],
                   ["王娜", 105, 21, "2018-08-11"]],
                  columns=["客户姓名", "唯一识别码", "年龄", "成交时间"],
                  index=["A1", "A2", "A3", "A4", "A5"])
df

   客户姓名  唯一识别码  年龄        成交时间
A1   张通    101  31  2018-08-08
A2   李古    102  45  2018-08-09
A3   孙凤    103  23  2018-08-10
A4   赵恒    104  36  2018-08-11
A5   王娜    105  21  2018-08-11

In [75]:
df[df["成交时间"] == datetime(2018,8,8).strftime('%Y-%m-%d')]  # 下次自己想！！！选取成交时间为2018年8月8日的订单
# print (datetime(2018,8,8).strftime('%Y-%m-%d'))
# print (df["成交时间"])

   客户姓名  唯一识别码  年龄        成交时间
A1   张通    101  31  2018-08-08

In [76]:
df[df["成交时间"] > datetime(2018,8,9).strftime('%Y-%m-%d')]  # 选取成交时间在2018年8月9日之后的订单

   客户姓名  唯一识别码  年龄        成交时间
A3   孙凤    103  23  2018-08-10
A4   赵恒    104  36  2018-08-11
A5   王娜    105  21  2018-08-11

In [77]:
df[df["成交时间"] < datetime(2018,8,10).strftime('%Y-%m-%d')]  # 选取成交时间在2018年8月10日之前的订单

   客户姓名  唯一识别码  年龄        成交时间
A1   张通    101  31  2018-08-08
A2   李古    102  45  2018-08-09

In [78]:
df[(df["成交时间"] > datetime(2018,8,8).strftime('%Y-%m-%d')) & (df["成交时间"] < datetime(2018,8,11).strftime('%Y-%m-%d'))]  # 选取成交时间在2018年8月8日到2018年8月11日之间的订单

   客户姓名  唯一识别码  年龄        成交时间
A2   李古    102  45  2018-08-09
A3   孙凤    103  23  2018-08-10

## 9.5 时间运算

### 9.5.1 两个时间之差

In [79]:
cha = datetime(2018,5,21,19,50) - datetime(2018,5,18,20,32)
cha  # 差值为2天83880秒

datetime.timedelta(days=2, seconds=83880)

In [80]:
cha.days  # 返回天的时间差

2

In [81]:
cha.seconds  # 返回秒的时间差

83880

In [82]:
cha.seconds/3600  # 换算成小时的时间差

23.3

### 9.5.2 时间偏移

在python中实现时间偏移的方式有两种：
1. timedelta: 只能偏移天、秒、微秒单位的时间；
2. Pandas 中的日期偏移量(date offset)。

- timedelta

In [83]:
from datetime import timedelta
date = datetime(2018,5,18,20,32)
# 往后推1天
date + timedelta(days=1)

datetime.datetime(2018, 5, 19, 20, 32)

In [84]:
# 往后推60秒
date + timedelta(seconds = 60)

datetime.datetime(2018, 5, 18, 20, 33)

In [85]:
# 往前推1天
date + timedelta(days=1)

datetime.datetime(2018, 5, 19, 20, 32)

In [86]:
# 往前推60秒
date + timedelta(seconds = 60)

datetime.datetime(2018, 5, 18, 20, 33)

- date offset

In [87]:
import pandas as pd
# import pandas.tseries.offset

date = datetime(2020,2,7,20,32)
date

datetime.datetime(2020, 2, 7, 20, 32)

In [88]:
# 往后推1天
date + pd.tseries.offsets.Day(1)  # 直接用Day(1)会报错，原因可能是因为没有单独的Day包

Timestamp('2020-02-08 20:32:00')

In [89]:
# 往后推1小时
date + pd.tseries.offsets.Hour(1)

Timestamp('2020-02-07 21:32:00')

In [90]:
# 往后推10分钟
date + pd.tseries.offsets.Minute(10)

Timestamp('2020-02-07 20:42:00')

In [91]:
# 往前推1天
date - pd.tseries.offsets.Day(1)

Timestamp('2020-02-06 20:32:00')

In [92]:
# 往前推1小时
date - pd.tseries.offsets.Hour(1)

Timestamp('2020-02-07 19:32:00')

In [93]:
# 往前推10分钟
date - pd.tseries.offsets.Minute(1)

Timestamp('2020-02-07 20:31:00')

# 第10章  数据分组/数据透视表

## 10.1 数据分组

数据分组：根据一个或多个键（可以是函数、数组或df列名）将数据分成若干组，然后对分组后的数据分别进行汇总计算，并将汇总计算后的结果进行合并，被用作汇总计算的函数称为**聚合函数**。
在python中对数据分组使用 groupby()方法

### 10.1.1 分组键是列名

In [94]:
df = pd.DataFrame([[59224, "A类", "一线城市", "是", 6, 20, 0], 
                   [55295, "B类", "三线城市", "否", 37, 27, 35], 
                   [46035, "A类", "二线城市", "是", 8, 1, 8],
                   [2459, "C类", "一线城市", "是", 7, 8, 14],
                   [22179, "B类", "三线城市", "否", 9, 12, 4]],
                  columns=["用户ID", "客户分类", "区域", "是否省会", "7月销量", "8月销量", "9月销量"],
                  index=[0, 1, 2, 3, 4])
df

    用户ID 客户分类    区域 是否省会  7月销量  8月销量  9月销量
0  59224   A类  一线城市    是     6    20     0
1  55295   B类  三线城市    否    37    27    35
2  46035   A类  二线城市    是     8     1     8
3   2459   C类  一线城市    是     7     8    14
4  22179   B类  三线城市    否     9    12     4

In [95]:
df.groupby("客户分类")  # 如果只是传入列名，返回的不是一个DataFrame对象，而是一个DataFrameGroupBy()对象，这个
# 对象包含着分组以后的若干组数据，但是没有直接显示出来，需要对这些分组数据进行汇总计算以后才会展示出来

In [96]:
df.groupby("客户分类").count()

      用户ID  区域  是否省会  7月销量  8月销量  9月销量
客户分类
A类       2   2     2     2     2     2
B类       2   2     2     2     2     2
C类       1   1     1     1     1     1

In [97]:
df.groupby("客户分类").sum()  # 如果对分组后的结果做一些数值运算，此时就只有数据类型是数值(int、float) 的列才会参与运算

        用户ID  7月销量  8月销量  9月销量
客户分类
A类    105259    14    21     8
B类     77474    46    39    39
C类      2459     7     8    14

把这种对分组后的数据进行汇总运算的操作成为**聚合**，使用的函数称为**聚合函数**。8.3节的汇总运算函数都可以作为聚合函数对分组后的数据进行聚合。

In [98]:
# 对分组后的数据进行计数运算
df.groupby(["客户分类", "区域"]).count()

           用户ID  是否省会  7月销量  8月销量  9月销量
客户分类 区域
A类   一线城市     1     1     1     1     1
     二线城市     1     1     1     1     1
B类   三线城市     2     2     2     2     2
C类   一线城市     1     1     1     1     1

In [99]:
# 对分组后的数据进行求和运算
df.groupby(["客户分类", "区域"]).sum()

            用户ID  7月销量  8月销量  9月销量
客户分类 区域
A类   一线城市  59224     6    20     0
     二线城市  46035     8     1     8
B类   三线城市  77474    46    39    39
C类   一线城市   2459     7     8    14

In [100]:
# 比如想看A、B、C类客户分别有多少，则先按照客户分类进行分组，然后把用户ID这一列取出来，在这一列的基础上进行技术汇总计算即可。
df.groupby("客户分类")["用户ID"].count()

客户分类
A类    2
B类    2
C类    1
Name: 用户ID, dtype: int64

### 10.1.2 分组键是Series

把DataFrame的其中一列取出来就是一个Series，比如下面的df["客户分类"]

In [101]:
df["客户分类"]

0    A类
1    B类
2    A类
3    C类
4    B类
Name: 客户分类, dtype: object

- 分组键是列名与分组键是Series的唯一区别是，给groupby()方法传入了什么，其他都一样。可以按照一个或多个Series进行分组，分组以后的汇总计算也是完全一样，也支持对分组以后的某些列进行汇总计算。

按照一个Series进行分组

In [102]:
# 对分组以后的数据进行计数运算
df.groupby(df["客户分类"]).count()

      用户ID  区域  是否省会  7月销量  8月销量  9月销量
客户分类
A类       2   2     2     2     2     2
B类       2   2     2     2     2     2
C类       1   1     1     1     1     1

按照多个Series进行分组

In [103]:
# 对分组以后的数据进行求和运算
df.groupby([df["客户分类"], df["区域"]]).sum()

            用户ID  7月销量  8月销量  9月销量
客户分类 区域
A类   一线城市  59224     6    20     0
     二线城市  46035     8     1     8
B类   三线城市  77474    46    39    39
C类   一线城市   2459     7     8    14

In [104]:
# 对分组以后的某些列进行汇总计算
df.groupby(df["客户分类"])["用户ID"].count()

客户分类
A类    2
B类    2
C类    1
Name: 用户ID, dtype: int64

### 10.1.3 神奇的aggregate方法

# issue 1

<span class="mark">aggregate</span>的第一神奇之处在于，一次可以使用多种汇总方式。

In [105]:
df.groupby("客户分类").aggregate(["count", "sum"])  # 非数值型也能拼接？？？

      用户ID            区域            是否省会      7月销量      8月销量      9月销量
     count     sum count       sum count sum count sum count sum count sum
客户分类
A类       2  105259     2  一线城市二线城市     2  是是     2  14     2  21     2   8
B类       2   77474     2  三线城市三线城市     2  否否     2  46     2  39     2  39
C类       1    2459     1      一线城市     1   是     1   7     1   8     1  14

aggregate的第二神奇之处在于，可以针对不同的列做不同的汇总运算

In [106]:
df.groupby("客户分类").aggregate({"用户ID": "count", "7月销量": "sum", "8月销量": "sum"})

      用户ID  7月销量  8月销量
客户分类
A类       2    14    21
B类       2    46    39
C类       1     7     8

### 10.1.4 对分组后的结果重置索引

由上节代码运行结果可以看出，DataFrameGroupBy 对象经汇总运算以后的形式并不是标准的DataFrame形式。为了接下来对分组结果进行进一步处理与分析，需要把其转换为标准DataFrame形式，利用重置索引**reset_index()** 方法。

In [107]:
df.groupby("客户分类").sum()

        用户ID  7月销量  8月销量  9月销量
客户分类
A类    105259    14    21     8
B类     77474    46    39    39
C类      2459     7     8    14

In [108]:
df.groupby("客户分类").sum().reset_index()

  客户分类    用户ID  7月销量  8月销量  9月销量
0   A类  105259    14    21     8
1   B类   77474    46    39    39
2   C类    2459     7     8    14

## 10.2 数据透视表

在行、列方向上同时拆分。

python实现

pivot_table()方法的全部参数如下：

pd.pivot_table(data, values=None, index=None, columns=None, aggfunc='mean',<span class="mark">fill_value</span>=None, margins=False, dropna=True, margins_name='All')

- data 表示要做数据透视表的整个表
- values 对应Excel中值的那个框
- index 对应Excel中行那个框
- columns 对应Excel中列的那个框
- aggfunc 表示对 values 的计算类型
- fill_value 表示对空值的填充值
- <span class="mark">margins 表示是否显示合计列</span>
- dropna 表示是否删除缺失，若为真则把一整行全作为缺失值删除
- margins_name 表示合计列的列名

In [109]:
pd.pivot_table(df, values="用户ID", columns="区域", index="客户分类", aggfunc='count')

区域    一线城市  三线城市  二线城市
客户分类
A类     1.0   NaN   1.0
B类     NaN   2.0   NaN
C类     1.0   NaN   NaN

- 以上运行结果没有合计列，python数据透视表中的合计列默认是关闭的，让其等于True可以显示出来

In [110]:
pd.pivot_table(df, values="用户ID", columns="区域", index="客户分类", aggfunc='count', margins = True)

区域    一线城市  三线城市  二线城市  All
客户分类
A类     1.0   NaN   1.0    2
B类     NaN   2.0   NaN    2
C类     1.0   NaN   NaN    1
All    2.0   2.0   1.0    5

- 合计列的名称默认是All，可以设置参数margins_name的值进行修改。如下所示：

In [111]:
pd.pivot_table(df, values="用户ID", columns="区域", index="客户分类", aggfunc='count', margins = True, margins_name="总计")

区域    一线城市  三线城市  二线城市  总计
客户分类
A类     1.0   NaN   1.0   2
B类     NaN   2.0   NaN   2
C类     1.0   NaN   NaN   1
总计     2.0   2.0   1.0   5

NaN表示缺失值，可通过设置参数fill_value的值对缺失值进行填充。示例如下所示。

In [112]:
# 将缺失值填充为0
pd.pivot_table(df, values = "用户ID", columns = "区域", index = "客户分类", aggfunc = 'count', margins = True, fill_value = 0)

区域    一线城市  三线城市  二线城市  All
客户分类
A类       1     0     1    2
B类       0     2     0    2
C类       1     0     0    1
All      2     2     1    5

aggfunc 用来表示计算类型，当只传入一种类型时表示对所有的值字段都进行同样的计算；如果需要对不同的值进行不同的计算类型，则需要传入一个字典，其中键为列名，值为计算方式。下面对用户ID进行计数，对7月销量进行求和。

In [113]:
pd.pivot_table(df, values=["用户ID", "7月销量"], columns = "区域", index = "客户分类", aggfunc = {"用户ID": "count", "7月销量": "sum"})

     7月销量            用户ID
区域   一线城市  三线城市 二线城市 一线城市 三线城市 二线城市
客户分类
A类    6.0   NaN  8.0  1.0  NaN  1.0
B类    NaN  46.0  NaN  NaN  2.0  NaN
C类    7.0   NaN  NaN  1.0  NaN  NaN

In [114]:
# 为了便于分析和处理，一般对数据透视表的结果重置索引，方法reset_index()
pd.pivot_table(df, values="用户ID", columns="区域", index="客户分类", aggfunc='count')

区域    一线城市  三线城市  二线城市
客户分类
A类     1.0   NaN   1.0
B类     NaN   2.0   NaN
C类     1.0   NaN   NaN

In [115]:
pd.pivot_table(df, values="用户ID", columns="区域", index="客户分类", aggfunc='count').reset_index()

区域 客户分类  一线城市  三线城市  二线城市
0    A类   1.0   NaN   1.0
1    B类   NaN   2.0   NaN
2    C类   1.0   NaN   NaN

# 第11章 多表拼接

## 11.1 表的横向拼接

- 即将两个表依据公共列拼接在一起。
- 在Excel中使用vlookup()函数；
- 在python中使用merge()方法。

### 11.1.1 连接表的类型

主要有3种情况：一对一、多对一、多对多。

In [116]:
# 一对一：连接的两个表的公共列是一对一的。
df1 = pd.DataFrame([[1, "小张", 100, 650], [2, "小王", 101, 600], [3, "小李", 102, 578], [4, "小赵", 103, 550]],
                  columns=["名次", "姓名", "学号", "成绩"])
df1

   名次  姓名   学号   成绩
0   1  小张  100  650
1   2  小王  101  600
2   3  小李  102  578
3   4  小赵  103  550

In [117]:
df2 = pd.DataFrame([[100, "一班"], [101, "一班"], [102, "二班"], [103, "三班"]],
                  columns=["学号", "班级"])
df2

    学号  班级
0  100  一班
1  101  一班
2  102  二班
3  103  三班

In [118]:
pd.merge(df1, df2)

   名次  姓名   学号   成绩  班级
0   1  小张  100  650  一班
1   2  小王  101  600  一班
2   3  小李  102  578  二班
3   4  小赵  103  550  三班

In [119]:
# 多对一：待连接的两个表的公共列不是一对一的，其中一个表的公共列有重复值，另一个表的公共列是唯一的。
df3 = pd.DataFrame([["小张", 100, 650], ["小王", 101, 600], ["小李", 102, 578]],
                  columns=["姓名", "学号", "f_成绩"])
df3  # df3纪录了第一次模拟考试成绩

   姓名   学号  f_成绩
0  小张  100   650
1  小王  101   600
2  小李  102   578

In [120]:
df4 = pd.DataFrame([[100, 586], [100, 602], [101, 691], [101, 702], [102, 645], [102, 676]],
                  columns=["学号", "e_成绩"])
df4  # df4纪录了学号和之后每次模拟考试成绩

    学号  e_成绩
0  100   586
1  100   602
2  101   691
3  101   702
4  102   645
5  102   676

In [121]:
pd.merge(df3, df4, on = "学号")  # 将df3和df4按照学号拼接，df3中学号是唯一的，但是df4中学号不唯一，因此拼接结果就是保留df4的重复值，且在df3中也增加重复值

   姓名   学号  f_成绩  e_成绩
0  小张  100   650   586
1  小张  100   650   602
2  小王  101   600   691
3  小王  101   600   702
4  小李  102   578   645
5  小李  102   578   676

In [122]:
# 多对多：待连接的两个表的公共列不是一对一，且两个表中的公共列都有重复值。
df5 = pd.DataFrame([["小张", 100, 650], ["小张", 100, 610], ["小王", 101, 600], ["小李", 102, 578], ["小李", 102, 542]],
                  columns=["姓名", "学号", "f_成绩"])
df5

   姓名   学号  f_成绩
0  小张  100   650
1  小张  100   610
2  小王  101   600
3  小李  102   578
4  小李  102   542

In [123]:
df6 = pd.DataFrame([[100, 650], [100, 610], [101, 600], [102, 578], [102, 542]],
                  columns=["学号", "e_成绩"])
df6

    学号  e_成绩
0  100   650
1  100   610
2  101   600
3  102   578
4  102   542

In [124]:
pd.merge(df5, df6)

   姓名   学号  f_成绩  e_成绩
0  小张  100   650   650
1  小张  100   650   610
2  小张  100   610   650
3  小张  100   610   610
4  小王  101   600   600
5  小李  102   578   578
6  小李  102   578   542
7  小李  102   542   578
8  小李  102   542   542

### 11.1.2 连接键的类型

- 默认以公共列作为连接键
- 用on来指定连接键
- 公共列可以有多列，即连接键可以有多个。

In [125]:
df1 = pd.DataFrame([[1, "小张", 100, 650], [2, "小王", 101, 600], [3, "小李", 102, 578], [4, "小赵", 103, 550]],
                  columns=["名次", "姓名", "学号", "成绩"])
df1

   名次  姓名   学号   成绩
0   1  小张  100  650
1   2  小王  101  600
2   3  小李  102  578
3   4  小赵  103  550

In [126]:
df2 = pd.DataFrame([["小张", 100, "一班"], ["小王", 101, "一班"], ["小李", 102, "二班"], ["小赵", 103, "三班"]],
                  columns=["姓名", "学号", "班级"])
df2

   姓名   学号  班级
0  小张  100  一班
1  小王  101  一班
2  小李  102  二班
3  小赵  103  三班

In [127]:
pd.merge(df1, df2, on = ["姓名", "学号"])

   名次  姓名   学号   成绩  班级
0   1  小张  100  650  一班
1   2  小王  101  600  一班
2   3  小李  102  578  二班
3   4  小赵  103  550  三班

In [128]:
# 分别指定左右连接键：当两表没有公共列时（实际值一样但列名不同，否则就无法连接了），就要分别指定左表和右表的连接键。使用的参数分别是left_on和right_on。
df1 = pd.DataFrame([[1, "小张", 100, 650], [2, "小王", 101, 600], [3, "小李", 102, 578], [4, "小赵", 103, 550]],
                  columns=["名次", "姓名", "编号", "成绩"])
df1

   名次  姓名   编号   成绩
0   1  小张  100  650
1   2  小王  101  600
2   3  小李  102  578
3   4  小赵  103  550

In [129]:
df2 = pd.DataFrame([["小张", 100, "一班"], ["小王", 101, "一班"], ["小李", 102, "二班"], ["小赵", 103, "三班"]],
                  columns=["姓名", "学号", "班级"])
df2

   姓名   学号  班级
0  小张  100  一班
1  小王  101  一班
2  小李  102  二班
3  小赵  103  三班

# issue 2

In [130]:
pd.merge(df1, df2, left_on="编号", right_on="学号")  # 为什么拼接失败？？？

   名次 姓名_x   编号   成绩 姓名_y   学号  班级
0   1   小张  100  650   小张  100  一班
1   2   小王  101  600   小王  101  一班
2   3   小李  102  578   小李  102  二班
3   4   小赵  103  550   小赵  103  三班

In [131]:
# 把索引当做连接键：索引列不算真正的列，当公共列是索引列时，就要把索引列当做连接键，使用的参数分别是left_index和right_index。

In [132]:
df1 = pd.DataFrame([[1, "小张", 100, 650], [2, "小王", 101, 600], [3, "小李", 102, 578], [4, "小赵", 103, 550]],
                  columns=["名次", "姓名", "编号", "成绩"],)
pd.pivot_table(df1, index="编号")

     名次   成绩
编号
100   1  650
101   2  600
102   3  578
103   4  550

### 11.1.3 连接方式

In [133]:
df1 = pd.DataFrame([[1, "小张", 100, 650], [2, "小王", 101, 600], [3, "小李", 102, 578], [4, "小赵", 103, 550]],
                  columns=["名次", "姓名", "学号", "成绩"])
df1

   名次  姓名   学号   成绩
0   1  小张  100  650
1   2  小王  101  600
2   3  小李  102  578
3   4  小赵  103  550

In [134]:
df2 = pd.DataFrame([["小张", 100, "一班"], ["小王", 101, "一班"], ["小李", 102, "二班"], ["小钱", 104, "三班"]],
                  columns=["姓名", "学号", "班级"])
df2

   姓名   学号  班级
0  小张  100  一班
1  小王  101  一班
2  小李  102  二班
3  小钱  104  三班

In [135]:
# 内连接就是取两个表中的公共部分
pd.merge(df1, df2, on="学号", how="inner")  # 如果不指名连接方式，则默认都是内连接

   名次 姓名_x   学号   成绩 姓名_y  班级
0   1   小张  100  650   小张  一班
1   2   小王  101  600   小王  一班
2   3   小李  102  578   小李  二班

In [136]:
# 左连接left：以左表为基础，右表往左表拼接。右表没有学号为103的信息，拼接过来的信息就用NaN填充
pd.merge(df1, df2, on="学号", how="left")

   名次 姓名_x   学号   成绩 姓名_y   班级
0   1   小张  100  650   小张   一班
1   2   小王  101  600   小王   一班
2   3   小李  102  578   小李   二班
3   4   小赵  103  550  NaN  NaN

In [137]:
# 右拼接right：以右表为基础，左表往右表上拼接。左表没有学号为104的信息，拼接过来的信息就用NaN填充
pd.merge(df1, df2,  on="学号", how="right")

    名次 姓名_x   学号     成绩 姓名_y  班级
0  1.0   小张  100  650.0   小张  一班
1  2.0   小王  101  600.0   小王  一班
2  3.0   小李  102  578.0   小李  二班
3  NaN  NaN  104    NaN   小钱  三班

In [138]:
# 外连接outer：取两个表的并集。
pd.merge(df1, df2, on="学号", how="outer")

    名次 姓名_x   学号     成绩 姓名_y   班级
0  1.0   小张  100  650.0   小张   一班
1  2.0   小王  101  600.0   小王   一班
2  3.0   小李  102  578.0   小李   二班
3  4.0   小赵  103  550.0  NaN  NaN
4  NaN  NaN  104    NaN   小钱   三班

### 11.1.4 重复列名处理

如上例中得姓名_x和姓名_y，两个表在进行拼接时，列名重复时 pd.merge()方法会自动添加后缀，我们可以自定义，只需修改参数 suffixes 的值即可，默认为["_x", "_y"]。

In [139]:
# 重复的列名加后缀_L和_R
pd.merge(df1, df2, on="学号", how="inner", suffixes=["_L", "_R"])

   名次 姓名_L   学号   成绩 姓名_R  班级
0   1   小张  100  650   小张  一班
1   2   小王  101  600   小王  一班
2   3   小李  102  578   小李  二班

## 11.2 表的纵向拼接

纵向拼接是在垂直方向进行拼接。一般的应用场景是将分离的若干个结构相同的数据表合成一个数据表。

- Excel中只需把表二复制粘贴到表一的下方即可。
- 在python中想纵向合并两个表，需用concat方法

### 11.2.1 普通合并

In [140]:
df1 = pd.DataFrame([["许丹", "一班"], ["李旭文", "一班"], ["程成", "一班"], ["赵涛", "一班"]],
                  columns=["姓名", "班级"],
                  index=[1, 2, 3, 4])
df1

    姓名  班级
1   许丹  一班
2  李旭文  一班
3   程成  一班
4   赵涛  一班

In [141]:
df2 = pd.DataFrame([["赵义", "二班"], ["李鹏", "二班"], ["卫来", "二班"], ["葛颜", "二班"]],
                  columns=["姓名", "班级"],
                  index=[1, 2, 3, 4])
df2

   姓名  班级
1  赵义  二班
2  李鹏  二班
3  卫来  二班
4  葛颜  二班

In [142]:
pd.concat([df1, df2])  # 这样就把一班和二班花名册合并到了一起

    姓名  班级
1   许丹  一班
2  李旭文  一班
3   程成  一班
4   赵涛  一班
1   赵义  二班
2   李鹏  二班
3   卫来  二班
4   葛颜  二班

### 11.2.2 索引设置

pd.concat()方法默认保留原表的索引，即上例中合并后显示的索引列编号为12341234，为了观看美观，可以通过设置参数 ignore_index 的值，让其等于True，就会生成一组新的索引。如下：

In [143]:
pd.concat([df1, df2], ignore_index = True)

    姓名  班级
0   许丹  一班
1  李旭文  一班
2   程成  一班
3   赵涛  一班
4   赵义  二班
5   李鹏  二班
6   卫来  二班
7   葛颜  二班

### 11.2.3 重叠数据合并

如果有错误数据，直接合并有重复值。

In [144]:
df1 = pd.DataFrame([["许丹", "一班"], ["李旭文", "一班"], ["程成", "一班"], ["赵涛", "一班"], ["葛颜", "二班"]],
                  columns=["姓名", "班级"],
                  index=[1, 2, 3, 4, 5])
df1

    姓名  班级
1   许丹  一班
2  李旭文  一班
3   程成  一班
4   赵涛  一班
5   葛颜  二班

In [145]:
df2 = pd.DataFrame([["赵义", "二班"], ["李鹏", "二班"], ["卫来", "二班"], ["葛颜", "二班"]],
                  columns=["姓名", "班级"],
                  index=[1, 2, 3, 4])
df2

   姓名  班级
1  赵义  二班
2  李鹏  二班
3  卫来  二班
4  葛颜  二班

In [146]:
pd.concat([df1, df2], ignore_index = True)

    姓名  班级
0   许丹  一班
1  李旭文  一班
2   程成  一班
3   赵涛  一班
4   葛颜  二班
5   赵义  二班
6   李鹏  二班
7   卫来  二班
8   葛颜  二班

> 在上列中“葛颜”出现了两次，可以通过 drop_duplicates()删除重复值

In [147]:
pd.concat([df1, df2], ignore_index = True).drop_duplicates()

    姓名  班级
0   许丹  一班
1  李旭文  一班
2   程成  一班
3   赵涛  一班
4   葛颜  二班
5   赵义  二班
6   李鹏  二班
7   卫来  二班

# 第12章 结果导出

## 12.1 导出为.xlsx文件

- 在Excel中：另存为即可，选择Excel工作薄（*.xlsx）格式。如果是将文件导出，那么只有PDF/XPS两种格式可选。
- 在python中用 df.to_excel()方法将文件导出为.xlsx格式。

### 12.1.1 设置文件导出路径

In [148]:
# # 调整参数 excel_writer 实现将这个文件导出到电脑的哪个文件夹、叫什么名字。
# df.to_excel(excel_writer = r"C:\Users\xuezh\Desktop\test.xlsx")  # 导出到桌面，名称为test.xlsx

**注意**：如果同一导出文件已经在本地打开，则不能再次运行导出代码，会报错。需将本地文件夹关闭以后再次运行。

### 12.1.2 设置Sheet名称

.xlsx格式的文件有多个Sheet，Sheet的默认命名方式是Sheet后加阿拉伯数字。可以通过sheet_name参数修改。

In [149]:
# df.to_excel(excel_writer = r"C:\Users\xuezh\Desktop\test.xlsx",
#            sheet_name = "test file")

### 12.1.3 设置索引

导出文件中关于索引的参数都是默认的，设置参数index = False 就可在导出时把这种索引去掉。

In [150]:
# df.to_excel(excel_writer = r"C:\Users\xuezh\Desktop\test.xlsx",
#            sheet_name = "test file",
#            index = False)

### 12.1.4 设置要导出的列

# issue 3

In [151]:
# df.to_excel(excel_writer = r"C:\Users\xuezh\Desktop\test.xlsx",
#            sheet_name = "test file",
#            index = False,
#            columns = ["用户ID", "7月销量", "8月销量", "9月销量"])  # 为什么出来还是全部的？没有选择到？

### 12.1.5 设置编码格式

In [155]:
# df.to_excel(excel_writer = r"C:\Users\xuezh\Desktop\test.xlsx",
#            sheet_name = "test file",
#            index = False,
#            encoding = "utf-8"
#            )

### 12.1.6 缺失值处理

In [ ]:
# df.to_excel(excel_writer = r"C:\Users\xuezh\Desktop\test1.xlsx",
#            sheet_name = "test1 file",
#            index = False,
#            encoding = "utf-8",
#            na_rep = 0  # 对缺失值填充为0
#            )

### 12.1.7 无穷值处理

无穷值（inf）和缺失值（Nan）都是异常数据，当用一个浮点数除以0时会得到一个无穷值，无穷值的存在会导致接下来的计算报错，因此要对其进行处理。

In [162]:
float("inf")

inf

In [164]:
float("-inf")

-inf

In [165]:
# 把 inf_rep 的值填充为0
# df.to_excel(excel_writer = r"C:\Users\xuezh\Desktop\test1.xlsx",
#            sheet_name = "test1 file",
#            index = False,
#            encoding = "utf-8",
#            na_rep = 0  # 缺失值填充为0
#            inf_rep = 0  # 无穷值填充为0
#            )

## 12.2 导出为.csv文件